task5/selected mesh (240_140_8)/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.01;

vertices
( 


 (-40 -28 0)
 (-2 -28 0)
 (2 -28 0)
 (56 -28 0)
 (56 -2 0)
 (56 2 0)
 (56 28 0)
 (2 28 0)
 (-2 28 0)
 (-40 28 0)
 (-40 2 0)
 (-40 -2 0)
 (-2 -2 0)
 (2 -2 0)
 (2 2 0)
 (-2 2 0)
(-40 -28 40)
 (-2 -28 40)
 (2 -28 40)
 (56 -28 40)
 (56 -2 40)
 (56 2 40)
 (56 28 40)
 (2 28 40)
 (-2 28 40)
 (-40 28 40)
 (-40 2 40)
 (-40 -2 40)
 (-2 -2 40)
 (2 -2 40)
 (2 2 40)
 (-2 2 40)
 
);

blocks
(
hex (2 13 12 1 18 29 28 17) (60 20 8) simpleGrading (1 1 1)
hex (3 4 13 2 19 20 29 18) (60 130 8) simpleGrading (1 1 1)
hex (4 5 14 13 20 21 30 29) (20 130 8) simpleGrading (1 1 1)
hex (5 6 7 14 21 22 23 30) (60 130 8) simpleGrading (1 1 1)
hex (14 7 8 15 30 23 24 31) (60 20 8) simpleGrading (1 1 1)
hex (15 8 9 10 31 24 25 26) (60 90 8) simpleGrading (1 1 1)
hex (12 15 10 11 28 31 26 27) (20 90 8) simpleGrading (1 1 1)
hex (1 12 11 0 17 28 27 16) (60 90 8) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type wall;
        faces
        (
            (10 9 25 26)
			(11 10 26 27 )
			(0 11 27 16 )
        );
    }
    
    outlet
    {
        type wall;
        faces
        (
            (6 5 21 22)
			(5 21 20 4)
			(4 3 19 20)
        );
    }
    
    top
    {
        type wall;
        faces
        (
            (9 8 24 25)
			(8 7 23 24)
			(7 6 22 23)
        );
    }
    
    bottom
    {
        type wall;
        faces
        (
            (1 0 16 17)
			(1 17 18 2)
			(3 2 18 19)
        );
    }
    
    cylinder
    {
        type wall;
        faces
        (
            (15 31 30 14)
			(30 14 13 29)
			(12 13 29 28)
			(31 15 12 28)
        );
    }
    
   sides
    {
        type wall;
        faces
        (
             (1 0 11 12)
            (2 1 12 13)
            (2 3 4 13)
            (4 13 14 5)
            (15 10 9 8)
            (12 11 10 15)
            (16 17 28 27)
            (5 14 7 6)
            (14 15 8 7)
            (17 18 29 28)
            (18 19 20 29)
            (20 21 30 29)
            (21 22 23 30)
            (30 23 24 31)
            (31 24 25 26)
            (28 31 26 27)
);
    }


);

mergePatchPairs
(
);

// ************************************************************************* //
