task5/selected mesh (240_140_8)/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 9.5e-5;              // should calculate using equation

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 9.5e-5;
    }
    outlet
    {
        type            zeroGradient;
        
    }   
	
	top
    {
        type            epsilonWallFunction;
        value           uniform 9.5e-5;
    }
	bottom
    {
        type            epsilonWallFunction;
        value           uniform 9.5e-5;
    }
	cylinder
    {
        type            epsilonWallFunction;
        value           uniform 9.5e-5;
    }
    sides
    {
        type            epsilonWallFunction;
        value           uniform 9.5e-5;
    }
}


// ************************************************************************* //
